tap "anomalyco/tap"
tap "d12frosted/emacs-plus"
tap "danvk/webdiff"
tap "dmmulroy/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "tilt-dev/tap"

brew "awscli"
brew "cagent"
brew "cmake"
brew "coreutils"
brew "dmmulroy/tap/jj-starship"
brew "docker-credential-helper-ecr"
brew "felixkratz/formulae/sketchybar"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "go-task"
brew "goimports"
brew "golangci-lint"
brew "googleworkspace-cli"
brew "goreleaser"
brew "graphviz"
brew "helm"
brew "ifstat"
brew "jj"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "libtool"
brew "modem-dev/tap/hunk"
brew "node@24"
brew "opencode"
brew "pgcli"
brew "pnpm"
brew "postgresql"
brew "pyright"
brew "specstoryai/tap/specstory"
brew "starship"
brew "stern"
brew "tailscale"
brew "tenv"
brew "tilt"
brew "tilt-dev/tap/ctlptl"
brew "tree-sitter"
brew "yq"
brew "zsh-completions"

cask "1password"
cask "aerospace"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "emacs-plus-app"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "gcloud-cli"
cask "slack"

go "golang.org/x/tools/gopls"
go "github.com/google/wire/cmd/wire"
